
        // Array of Bangla random facts
        const banglaFacts = [

            "লালবাগ কেল্লা অবস্থান- ঢাকার লালবাগে ",
            " লালবাগ কেল্লার পূর্বনাম- আওরঙ্গবাদ দুর্গ  ",
            " লালবাগ কেল্লার  নির্মাতা - ১৬৭৮ সালে মোঘল সম্রাট আওরঙ্গজেবের শাসনামলে তাঁর পুত্র শাহজাদা মোহাম্মদ আজম শাহ নির্মাণ কাজ শুরু করেন ।",
            " লালবাগ কেল্লার  নির্মাণকাল-১৬৭৮-১৬৮৪ (শায়েস্তা খাঁ নির্মাণ সমাপ্ত করেন) ।",
            " মালয়েশিয়ার স্বাধীনতার জনক ও প্রথম প্রধানমন্ত্রী- টেংকু আবদুল রহমান।  ",
            "  মালয়েশিয়া উপনিবেশ ছিল- ব্রিটেনের। ",
            "  মালয়েশিয়ার সাংবিধানিক রাজধানী- কুয়ালালামপুর। ",
            "  মালয়েশিয়ার প্রশাসনিক ও বিচারবিভাগীয় রাজধানীর নাম- পুত্রজায়া। ",
            "  বাংলাদেশের দ্বিতীয় বিশ্ববিদ্যালয় - রাজশাহী বিশ্ববিদ্যালয়। ",
            " রাজশাহী বিশ্ববিদ্যালয়  প্রথম ডি.সি ছিলেন- ইসরাত হোসেন জুবেরী।  ",
            " মালয়েশিয়ার সর্বোচ্চ ভবনের নাম- পেট্রোনাস টুইন টাওয়ার।  ",
            "  রাজশাহী বিশ্ববিদ্যালয় প্রতিষ্ঠিত হয় - স্যাডলার কমিশনের (১৯১৭) রিপোর্টের ভিত্তিতে ১৯৫৩ সালের ৬ জুলাই। ",
            " আধুনিক মালয়েশিয়ার স্থপতি ও প্রধানমন্ত্রী ছিলেন- ডা. মাহাথির মোহাম্মদ।  ",
            "  চট্টগ্রাম বিশ্ববিদ্যালয় প্রতিষ্ঠিত হয়- ১৯৬৬ সালের ১৮ নভেম্বর। ",
            "  জাহাঙ্গীরনগর বিশ্ববিদ্যালয়  প্রতিষ্ঠিত হয়- ১৯৭০ সালে। ",
            " চট্টগ্রাম বিশ্ববিদ্যালয় অবস্থিত- চট্টগ্রাম জেলার হাটহাজারী থানার জোবরা গ্রামে।  ",
            "  জাহাঙ্গীরনগর বিশ্ববিদ্যালয়  প্রতিষ্ঠিত হয়- ১৯৭০ সালে। ",
            "   চট্টগ্রাম বিশ্ববিদ্যালয় এর প্রথম ভিসি ছিলেন- আজিজুর রহমান মল্লিক।",
            " দেশের একমাত্র আবাসিক বিশ্ববিদ্যালয় এবং প্রথম নাম ছিল- জাহাঙ্গীরনগর মুসলিম বিশ্ববিদ্যালয়।  ",
            " রাজশাহী বিশ্ববিদ্যালয় এ যাত্রাকালে শিক্ষক ছিল- ১৬১ জন।  ",
            "  জাহাঙ্গীরনগর বিশ্ববিদ্যালয়  প্রতিষ্ঠাকালে বিভাগ ছিল ৪টি এবং ছাত্র-ছাত্রী ছিল - ১৫০ জন। ",
            "  জাহাঙ্গীরনগর বিশ্ববিদ্যালয়ে বিখ্যাত ভাস্কর্য- সংসপ্তক এবং অমর একুশে। ",
            "  খুলনা বিশ্ববিদ্যালয় প্রতিষ্ঠিত- ১৯৮৭ সালের ৪ জানুয়ারি , ময়ূরী নদীর তীরে। ",
            " খুলনা বিশ্ববিদ্যালয়ের একাডেমিক ভাবে যাত্রা- ১৯৯১ সালের ২৫ নভেম্বর।  ",
            "  জাহাঙ্গীরনগর বিশ্ববিদ্যালয় প্রথম ভিসি ছিলেন- ড. মফিজ উদ্দিন আহমেদ। ",
            "  জাহাঙ্গীরনগর বিশ্ববিদ্যালয়ে কবি সৈয়দ আলী আহসান ছিলেন- ভিসি। ",

           
          ];
          
          // Function to get a random Bangla fact
          function getBanglaFact() {
            const randomIndex = Math.floor(Math.random() * banglaFacts.length);
            return banglaFacts[randomIndex];
          }
          
          // Display random Bangla fact
          const factElement = document.getElementById("banglaFact");
          factElement.innerText = getBanglaFact();
          
          // Optional: refresh the fact on button click
          document.getElementById("newBanglaFactButton").addEventListener("click", () => {
            factElement.innerText = getBanglaFact();
          });